'use strict';
// 1)пользователю предлагается в prompt ввести число
// 2)Ввод сохраняется в переменную input и добавляется в массив чисел numbers
// 3) ввод продолжается до тех пор, пока пользователь не нажмет Cancel.
// 4) После того как пользователь прекратил ввод нажав Cancel:
//     - проверить пустой ли массив ил нет;
//     -посчитать сумму всех элементов массива и записать ее в переменную total
//     -в консоль выведи строку 'Общая сумма чисел равна [сумма]'


let input;
const numbers = [];
let total = 0;
